# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonItem..::..Name Property
RibbonItem Class See Also
---
The name of the item.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Name { get; internal set; }
```

Visual Basic
---
```text
Public Property Name As String
	Get
	Friend Set
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
	internal: void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when setting the text to empty or to the string contains "%". |

# See Also
RibbonItem Class
Autodesk.Revit.UI Namespace